USE EmployeeAccounting
INSERT INTO Employee (Name, Patronymic, Surname, B_Date, Work_Exp)  
VALUES 
('Петр', 'Борисович', 'Чебупелин', '12-12-1973', 7),
('Иван', DEFAULT, 'Некрасов', '08-07-1985', 5),
('Семен', 'Казимирович', 'Тошин', '01-23-1969', 10),
('Марат', 'Климович', 'Шориных', '02-29-1996', 2),
('Александр', 'Александрович', 'Грошевич', '03-19-2002', 0),
('Анна', 'Андреевна', 'Шориных', '09-06-1998', 2),
('Лариса', 'Николаевна', 'Громова', '11-15-1969', 11),
('Наталья', 'Вечеславовна', 'Жур', '05-11-2000', 0),
('Татьяна', 'Михайловна', 'Лаврова', '03-24-1977', 8),
('Арина', 'Станиславовна', 'Малодумина', '10-18-1999', 4)

INSERT INTO EducationInstitution (Edu_Name, Edu_Rating)
VALUES
('Марсианский Всепланетарный Университет', 9),
('Митьянский Национальный Технический Университет', 7),
('Экономический Университет Пятого Округа', 8),
('Нижнеречский государственный областной лицей', 9),
('Чужестранский Университет Роботолепки', 10),
('Зареченский Научный Центр Изучения Грусти', 6),
('Подлужинский Колледж сферы обслуживания', 6),
('Икарский Лицей Ракетомоделирования', 10),
('Лицей Марсианского Всепланитарного Университета', 10),
('Оченьстранный Университет Штучкоделания', 8)

INSERT INTO Education (Empl_ID, Edu_ID, Education, Speciality, Grad_Year)
VALUES
(1, 10, 'высшее', 'главный штучкодел', 1985),
(2, 5, 'высшее', 'магистр роботолепских наук', 1999),
(2, 9, 'среднее', 'марсианин', 1994),
(3, 3, 'высшее', 'главный эконом', 1999),
(4, 8, 'среднее', 'ракетомоделёр', 2014),
(5, 6, 'высшее', 'профессор грусти', 2023),
(6, 1, 'высшее', 'специалист по межпланетным коммуникациям', 2019),
(6, 9, 'среднее', 'марсианин', 2015),
(7, 7, 'среднее', 'техник-электромеханик', 1986),
(7, 3, 'высшее', 'специалист по марсианской экономике', 1991),
(8, 2, 'высшее', 'экстрасенс', 2021),
(9, 4, 'среднее', 'нижнеречка', 1994),
(9, 10, 'высшее', 'технолог зонтичного дела', 1999),
(10, 7, 'среднее', 'парикмахер', 2016)

INSERT INTO Appointment (Empl_ID, Post, Salary, Department, App_Date)
VALUES
(1, 'заведующий отдела штучкоделания', 28787.89, 6, '02-29-2016'),
(1, 'штучкодел', 17905.3, 6, '07-13-2014'),
(2, 'главный инженер роботолепки', 30761, 7, '09-01-2018'),
(3, 'дегустатор фасолевого супа', 40678, 1, '07-06-2013'),
(4, 'ракетомоделёр', 22222.11, 7, '02-02-2021'),
(4, 'ведущий ракетомоделёр', 27222.77, 7, '05-08-2023'),
(5, 'грустный грузть', 25162, 3, '09-17-2023'),
(6, 'специалистка по коммуникациям', 38389, 2, '12-31-2021'),
(7, 'электромеханик', 17813.52, 7, '11-04-2012'), 
(7, 'марсианский экономист', 39999.99, 1, '06-15-2017'),
(8, 'главный экстрасенс', 39367, 4, '09-15-2023'), 
(9, 'зонтодел-технолог', 33333, 5, '07-17-2013'),
(10, 'стилист-парикмахер', 18189.34, 6, '04-03-2019')

INSERT INTO Vacation(Empl_ID, Inc_Beginning, Inc_End)
VALUES
(3, '07-13-2013', '08-13-2013'),
(9, '05-01-2014', '05-22-2014'),
(7, '11-04-2013', '11-25-2013'),
(1, '12-13-2014', '12-28-2014'),
(3, '01-13-2014', '02-13-2014'),
(1, '03-29-2016', '04-18-2016'),
(9, '03-04-2017', '03-25-2017'),
(2, '11-13-2018', '12-05-2018'),
(3, '12-25-2018', '02-25-2019'),
(7, '03-17-2019', '04-13-2019')

INSERT INTO SickLeave(Empl_ID, Inc_Beginning, Inc_End)
VALUES
(3, '09-13-2013', '10-13-2013'),
(3, '10-15-2013', '10-30-2013'),
(3, '12-28-2014', '01-17-2015'),
(3, '07-27-2014', '08-13-2014'),
(3, '09-18-2017', '10-12-2017'),
(4, '05-15-2021', '05-30-2021'),
(9, '12-15-2021', '12-25-2021'),
(10, '01-17-2022', '01-30-2022'),
(7, '03-14-2022', '03-28-2022'),
(2, '09-17-2023', '09-30-2023')
